---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.InsufficientResourcesException
source: html/d3dc647b-d3a0-ed25-46e2-5a9e14374585.htm
---
# InsufficientResourcesException Members

Retrieves data needed to serialize the target object.